# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
import os
clear = lambda: os.system('cls')
clear()

# НЕУВЕРЕНА В РЕШЕНИИ , ВЕРНУТЬСЯ ПОЗЖЕ


# from math import pi

# d = int(input('Введите точность d для числа pi: '))
# print(f'Число pi с точностью {d} -> {round(pi,d)}')